var allStations = [
    {
        "name": "Сокольническая линия",
        "color": "#cd0505",
        "stations": [
            {
                "name": "Улица Подбельского",
                "lat": 55.814527,
                "lng": 37.73426100000006
            },
            {
                "name": "Черкизовская",
                "lat": 55.803943,
                "lng": 37.74476400000003
            },
            {
                "name": "Преображенская площадь",
                "lat": 55.79624,
                "lng": 37.71547399999997
            },
            {
                "name": "Сокольники",
                "lat": 55.78925,
                "lng": 37.67968300000007
            },
            {
                "name": "Красносельская",
                "lat": 55.77999699999999,
                "lng": 37.66607899999997
            },
            {
                "name": "Комсомольская",
                "lat": 55.776241,
                "lng": 37.65587000000005
            },
            {
                "name": "Красные ворота",
                "lat": 55.76908,
                "lng": 37.649106000000074
            },
            {
                "name": "Чистые пруды",
                "lat": 55.764928,
                "lng": 37.638435999999956
            },
            {
                "name": "Лубянка",
                "lat": 55.75966,
                "lng": 37.62658099999999
            },
            {
                "name": "Охотный ряд",
                "lat": 55.757879,
                "lng": 37.616634999999974
            },
            {
                "name": "Библиотека им. Ленина",
                "lat": 55.752252,
                "lng": 37.61049300000002
            },
            {
                "name": "Кропоткинская",
                "lat": 55.745155,
                "lng": 37.60303099999999
            },
            {
                "name": "Парк культуры",
                "lat": 55.735204,
                "lng": 37.593074
            },
            {
                "name": "Фрунзенская",
                "lat": 55.727474,
                "lng": 37.58068300000002
            },
            {
                "name": "Спортивная",
                "lat": 55.723338,
                "lng": 37.56406900000002
            },
            {
                "name": "Воробьёвы горы",
                "lat": 55.710409,
                "lng": 37.55942300000004
            },
            {
                "name": "Университет",
                "lat": 55.69255099999999,
                "lng": 37.534591999999975
            },
            {
                "name": "Проспект Вернадского",
                "lat": 55.676978,
                "lng": 37.506309999999985
            },
            {
                "name": "Юго-Западная",
                "lat": 55.66375000000001,
                "lng": 37.48315200000002
            }
        ]
    },
    {
        "name": "Замоскворецкая линия",
        "color": "#0a6f20",
        "stations": [
            {
                "name": "Алма-Атинская",
                "lat": 55.632813,
                "lng": 37.766061000000036
            },
            {
                "name": "Красногвардейская",
                "lat": 55.61386599999999,
                "lng": 37.74454400000002
            },
            {
                "name": "Домодедовская",
                "lat": 55.61095299999999,
                "lng": 37.71909000000005
            },
            {
                "name": "Орехово",
                "lat": 55.613195,
                "lng": 37.69496600000002
            },
            {
                "name": "Царицыно",
                "lat": 55.62145599999999,
                "lng": 37.669452999999976
            },
            {
                "name": "Кантемировская",
                "lat": 55.635715,
                "lng": 37.656600000000026
            },
            {
                "name": "Каширская",
                "lat": 55.655134,
                "lng": 37.64884299999994
            },
            {
                "name": "Коломенская",
                "lat": 55.678271,
                "lng": 37.66384199999993
            },
            {
                "name": "Автозаводская",
                "lat": 55.707394,
                "lng": 37.65729699999997
            },
            {
                "name": "Павелецкая",
                "lat": 55.731266,
                "lng": 37.636262999999985
            },
            {
                "name": "Новокузнецкая",
                "lat": 55.742424,
                "lng": 37.62926300000004
            },
            {
                "name": "Театральная",
                "lat": 55.7576,
                "lng": 37.61873800000001
            },
            {
                "name": "Тверская",
                "lat": 55.764847,
                "lng": 37.60486000000003
            },
            {
                "name": "Маяковская",
                "lat": 55.770126,
                "lng": 37.59593399999994
            },
            {
                "name": "Белорусская",
                "lat": 55.777094,
                "lng": 37.58184700000004
            },
            {
                "name": "Динамо",
                "lat": 55.789711,
                "lng": 37.55818399999998
            },
            {
                "name": "Аэропорт",
                "lat": 55.800365,
                "lng": 37.53262799999993
            },
            {
                "name": "Сокол",
                "lat": 55.80478,
                "lng": 37.51554799999997
            },
            {
                "name": "Войковская",
                "lat": 55.819087,
                "lng": 37.49788799999999
            },
            {
                "name": "Водный стадион",
                "lat": 55.83596739999999,
                "lng": 37.483592499999986
            },
            {
                "name": "Речной вокзал",
                "lat": 55.855055,
                "lng": 37.47610899999995
            }
        ]
    },
    {
        "name": "Арбатско-Покровская линия",
        "color": "#023a7a",
        "stations": [
            {
                "name": "Пятницкое шоссе",
                "lat": 55.85587599999999,
                "lng": 37.354180999999926
            },
            {
                "name": "Митино",
                "lat": 55.846006,
                "lng": 37.36136399999998
            },
            {
                "name": "Волоколамская",
                "lat": 55.83574900000001,
                "lng": 37.38198999999997
            },
            {
                "name": "Мякинино",
                "lat": 55.82547599999999,
                "lng": 37.385369999999966
            },
            {
                "name": "Строгино",
                "lat": 55.803723,
                "lng": 37.40308300000004
            },
            {
                "name": "Крылатское",
                "lat": 55.75683799999999,
                "lng": 37.40801299999998
            },
            {
                "name": "Молодежная",
                "lat": 55.74061099999999,
                "lng": 37.41691800000001
            },
            {
                "name": "Кунцевская",
                "lat": 55.730757,
                "lng": 37.44592799999998
            },
            {
                "name": "Славянский бульвар",
                "lat": 55.72957599999999,
                "lng": 37.470717000000036
            },
            {
                "name": "Парк Победы",
                "lat": 55.736217,
                "lng": 37.516835000000015
            },
            {
                "name": "Киевская",
                "lat": 55.743631,
                "lng": 37.566487999999936
            },
            {
                "name": "Смоленская",
                "lat": 55.74773,
                "lng": 37.58384799999999
            },
            {
                "name": "Арбатская",
                "lat": 55.752161,
                "lng": 37.60151799999994
            },
            {
                "name": "Площадь Революции",
                "lat": 55.75657,
                "lng": 37.62165600000003
            },
            {
                "name": "Курская",
                "lat": 55.758727,
                "lng": 37.65957700000001
            },
            {
                "name": "Бауманская",
                "lat": 55.772481,
                "lng": 37.67916300000002
            },
            {
                "name": "Электрозаводская",
                "lat": 55.782094,
                "lng": 37.705287
            },
            {
                "name": "Семеновская",
                "lat": 55.78306,
                "lng": 37.719423000000006
            },
            {
                "name": "Партизанская",
                "lat": 55.78845099999999,
                "lng": 37.74961899999994
            },
            {
                "name": "Измайловская",
                "lat": 55.787775,
                "lng": 37.78143499999999
            },
            {
                "name": "Первомайская",
                "lat": 55.794507,
                "lng": 37.79936299999997
            },
            {
                "name": "Щелковская",
                "lat": 55.809286,
                "lng": 37.79862800000001
            }
        ]
    },
    {
        "name": "Филевская линия",
        "color": "#069cd3",
        "stations": [
            {
                "name": "Александровский сад",
                "lat": 55.752289,
                "lng": 37.60866299999998
            },
            {
                "name": "Арбатская",
                "lat": 55.752161,
                "lng": 37.60151799999994
            },
            {
                "name": "Смоленская",
                "lat": 55.74773,
                "lng": 37.58384799999999
            },
            {
                "name": "Киевская",
                "lat": 55.743631,
                "lng": 37.566487999999936
            },
            {
                "name": "Выставочная",
                "lat": 55.749156,
                "lng": 37.54383400000006
            },
            {
                "name": "Международная",
                "lat": 59.870167,
                "lng": 30.37930499999993
            },
            {
                "name": "Студенческая",
                "lat": 55.73887800000001,
                "lng": 37.54834099999994
            },
            {
                "name": "Кутузовская",
                "lat": 55.740005,
                "lng": 37.53437699999995
            },
            {
                "name": "Фили",
                "lat": 55.746099,
                "lng": 37.514797000000044
            },
            {
                "name": "Багратионовская",
                "lat": 55.743792,
                "lng": 37.497743000000014
            },
            {
                "name": "Филевский парк",
                "lat": 55.73957000000001,
                "lng": 37.48330199999998
            },
            {
                "name": "Пионерская",
                "lat": 55.73604,
                "lng": 37.467070000000035
            },
            {
                "name": "Кунцевская",
                "lat": 55.730757,
                "lng": 37.44592799999998
            }
        ]
    },
    {
        "name": "Кольцевая линия",
        "color": "#7f0000",
        "stations": [
            {
                "name": "Белорусская",
                "lat": 55.777094,
                "lng": 37.58184700000004
            },
            {
                "name": "Новослободская",
                "lat": 55.77951400000001,
                "lng": 37.601061999999956
            },
            {
                "name": "Проспект Мира",
                "lat": 55.779653,
                "lng": 37.63361899999995
            },
            {
                "name": "Комсомольская",
                "lat": 55.776241,
                "lng": 37.65587000000005
            },
            {
                "name": "Курская",
                "lat": 55.758727,
                "lng": 37.65957700000001
            },
            {
                "name": "Таганская",
                "lat": 55.739458,
                "lng": 37.65324199999998
            },
            {
                "name": "Павелецкая",
                "lat": 55.731266,
                "lng": 37.636262999999985
            },
            {
                "name": "Добрынинская",
                "lat": 55.728986,
                "lng": 37.62277700000004
            },
            {
                "name": "Октябрьская",
                "lat": 55.729254,
                "lng": 37.611312999999996
            },
            {
                "name": "Парк культуры",
                "lat": 55.735204,
                "lng": 37.593074
            },
            {
                "name": "Киевская",
                "lat": 55.743631,
                "lng": 37.566487999999936
            },
            {
                "name": "Краснопресненская",
                "lat": 55.760325,
                "lng": 37.577223000000004
            }
        ]
    },
    {
        "name": "Калужско-Рижская линия",
        "color": "#ff7f00",
        "stations": [
            {
                "name": "Медведково",
                "lat": 55.887204,
                "lng": 37.661471000000006
            },
            {
                "name": "Бабушкинская",
                "lat": 55.86953399999999,
                "lng": 37.66420700000003
            },
            {
                "name": "Свиблово",
                "lat": 55.855265,
                "lng": 37.65306499999997
            },
            {
                "name": "Ботанический сад",
                "lat": 55.845341,
                "lng": 37.638709999999946
            },
            {
                "name": "ВДНХ",
                "lat": 55.82106100000001,
                "lng": 37.641478000000006
            },
            {
                "name": "Алексеевская",
                "lat": 55.807779,
                "lng": 37.63869299999999
            },
            {
                "name": "Рижская",
                "lat": 55.792496,
                "lng": 37.63615099999993
            },
            {
                "name": "Проспект Мира",
                "lat": 55.779653,
                "lng": 37.63361899999995
            },
            {
                "name": "Сухаревская",
                "lat": 55.772293,
                "lng": 37.632443999999964
            },
            {
                "name": "Тургеневская",
                "lat": 55.76584,
                "lng": 37.63677299999995
            },
            {
                "name": "Китай-город",
                "lat": 55.756951,
                "lng": 37.63093700000002
            },
            {
                "name": "Третьяковская",
                "lat": 55.74072899999999,
                "lng": 37.62558799999999
            },
            {
                "name": "Октябрьская",
                "lat": 55.729254,
                "lng": 37.611312999999996
            },
            {
                "name": "Шаболовская",
                "lat": 55.718815,
                "lng": 37.608138000000054
            },
            {
                "name": "Ленинский проспект",
                "lat": 55.707593,
                "lng": 37.586464999999976
            },
            {
                "name": "Академическая",
                "lat": 55.687911,
                "lng": 37.573532
            },
            {
                "name": "Профсоюзная",
                "lat": 55.67798699999999,
                "lng": 37.56287299999997
            },
            {
                "name": "Новые Черемушки",
                "lat": 55.670385,
                "lng": 37.55471899999998
            },
            {
                "name": "Калужская",
                "lat": 55.65716699999999,
                "lng": 37.54042800000002
            },
            {
                "name": "Беляево",
                "lat": 55.64260299999999,
                "lng": 37.52644799999996
            },
            {
                "name": "Коньково",
                "lat": 55.633312,
                "lng": 37.51926500000002
            },
            {
                "name": "Теплый Стан",
                "lat": 55.618528,
                "lng": 37.507383000000004
            },
            {
                "name": "Ясенево",
                "lat": 55.606168,
                "lng": 37.53360999999995
            },
            {
                "name": "Новоясеневская",
                "lat": 55.601903,
                "lng": 37.55285700000002
            }
        ]
    },
    {
        "name": "Таганско-Краснопресненская линия",
        "color": "#92007b",
        "stations": [
            {
                "name": "Жулебино",
                "lat": 55.68539,
                "lng": 37.856289999999944
            },
            {
                "name": "Лермонтовский проспект",
                "lat": 55.701193,
                "lng": 37.852712
            },
            {
                "name": "Выхино",
                "lat": 55.71565,
                "lng": 37.81790799999999
            },
            {
                "name": "Рязанский проспект",
                "lat": 55.716922,
                "lng": 37.79327999999998
            },
            {
                "name": "Кузьминки",
                "lat": 55.705474,
                "lng": 37.765664000000015
            },
            {
                "name": "Текстильщики",
                "lat": 55.708956,
                "lng": 37.73128299999996
            },
            {
                "name": "Волгоградский проспект",
                "lat": 55.72499999999999,
                "lng": 37.68692999999996
            },
            {
                "name": "Пролетарская",
                "lat": 55.731711,
                "lng": 37.66636900000003
            },
            {
                "name": "Таганская",
                "lat": 55.739458,
                "lng": 37.65324199999998
            },
            {
                "name": "Китай-город",
                "lat": 55.756951,
                "lng": 37.63093700000002
            },
            {
                "name": "Кузнецкий мост",
                "lat": 55.761548,
                "lng": 37.624413000000004
            },
            {
                "name": "Пушкинская",
                "lat": 55.76495500000001,
                "lng": 37.605906000000004
            },
            {
                "name": "Баррикадная",
                "lat": 55.760706,
                "lng": 37.581251000000066
            },
            {
                "name": "Улица 1905 года",
                "lat": 55.764703,
                "lng": 37.561451000000034
            },
            {
                "name": "Беговая",
                "lat": 55.773661,
                "lng": 37.546757999999954
            },
            {
                "name": "Полежаевская",
                "lat": 55.777524,
                "lng": 37.51950099999999
            },
            {
                "name": "Октябрьское поле",
                "lat": 55.79352,
                "lng": 37.493537999999944
            },
            {
                "name": "Щукинская",
                "lat": 55.808519,
                "lng": 37.46439299999997
            },
            {
                "name": "Тушинская",
                "lat": 55.82650599999999,
                "lng": 37.437055999999984
            },
            {
                "name": "Сходненская",
                "lat": 55.850657,
                "lng": 37.439840000000004
            },
            {
                "name": "Планерная",
                "lat": 55.86073099999999,
                "lng": 37.43646000000001
            }
        ]
    },
    {
        "name": "Калининская линия",
        "color": "#ffdd03",
        "stations": [
            {
                "name": "Новокосино",
                "lat": 55.745106,
                "lng": 37.864014999999995
            },
            {
                "name": "Новогиреево",
                "lat": 55.751699,
                "lng": 37.816642
            },
            {
                "name": "Перово",
                "lat": 55.75118999999999,
                "lng": 37.78664900000001
            },
            {
                "name": "Шоссе Энтузиастов",
                "lat": 55.758303,
                "lng": 37.75152300000002
            },
            {
                "name": "Авиамоторная",
                "lat": 55.751619,
                "lng": 37.717218
            },
            {
                "name": "Площадь Ильича",
                "lat": 55.746823,
                "lng": 37.680965000000015
            },
            {
                "name": "Марксистская",
                "lat": 55.740879,
                "lng": 37.656519
            },
            {
                "name": "Третьяковская",
                "lat": 55.74072899999999,
                "lng": 37.62558799999999
            }
        ]
    },
    {
        "name": "Серпуховско-Тимирязевская линия",
        "color": "#7e8196",
        "stations": [
            {
                "name": "Алтуфьево",
                "lat": 55.897864,
                "lng": 37.58708200000001
            },
            {
                "name": "Бибирево",
                "lat": 55.88399099999999,
                "lng": 37.603605000000016
            },
            {
                "name": "Отрадное",
                "lat": 55.863397,
                "lng": 37.60461899999996
            },
            {
                "name": "Владыкино",
                "lat": 55.84725,
                "lng": 37.58985000000007
            },
            {
                "name": "Петровско-Разумовская",
                "lat": 55.83666100000001,
                "lng": 37.57535000000007
            },
            {
                "name": "Тимирязевская",
                "lat": 55.819012,
                "lng": 37.578891
            },
            {
                "name": "Дмитровская",
                "lat": 55.807993,
                "lng": 37.58117600000003
            },
            {
                "name": "Савеловская",
                "lat": 55.794083,
                "lng": 37.58814400000006
            },
            {
                "name": "Менделеевская",
                "lat": 55.78174,
                "lng": 37.59894299999996
            },
            {
                "name": "Цветной бульвар",
                "lat": 55.771682,
                "lng": 37.62068499999998
            },
            {
                "name": "Чеховская",
                "lat": 55.765893,
                "lng": 37.608303999999976
            },
            {
                "name": "Боровицкая",
                "lat": 55.750508,
                "lng": 37.609151999999995
            },
            {
                "name": "Полянка",
                "lat": 55.736802,
                "lng": 37.61857699999996
            },
            {
                "name": "Серпуховская",
                "lat": 55.726798,
                "lng": 37.62528199999997
            },
            {
                "name": "Тульская",
                "lat": 55.70867699999999,
                "lng": 37.622423000000026
            },
            {
                "name": "Нагатинская",
                "lat": 55.68300199999999,
                "lng": 37.621758
            },
            {
                "name": "Нагорная",
                "lat": 55.672998,
                "lng": 37.61083600000006
            },
            {
                "name": "Нахимовский проспект",
                "lat": 55.662596,
                "lng": 37.605321
            },
            {
                "name": "Севастопольская",
                "lat": 55.651315,
                "lng": 37.598337000000015
            },
            {
                "name": "Чертановская",
                "lat": 55.64083300000001,
                "lng": 37.60622799999999
            },
            {
                "name": "Южная",
                "lat": 55.622449,
                "lng": 37.608705999999984
            },
            {
                "name": "Пражская",
                "lat": 55.61232099999999,
                "lng": 37.604172999999946
            },
            {
                "name": "Улица Академика Янгеля",
                "lat": 55.595155,
                "lng": 37.60137299999997
            },
            {
                "name": "Аннино",
                "lat": 55.583643,
                "lng": 37.59682900000007
            },
            {
                "name": "Бульвар Дмитрия Донского",
                "lat": 55.569497,
                "lng": 37.57643899999994
            }
        ]
    },
    {
        "name": "Люблинско-Дмитровская линия",
        "color": "#8cce3a",
        "stations": [
            {
                "name": "Марьина Роща",
                "lat": 55.793574,
                "lng": 37.61632899999995
            },
            {
                "name": "Достоевская",
                "lat": 55.781316,
                "lng": 37.613786000000005
            },
            {
                "name": "Трубная",
                "lat": 55.767798,
                "lng": 37.62190799999996
            },
            {
                "name": "Сретенский бульвар",
                "lat": 55.765802,
                "lng": 37.63925100000006
            },
            {
                "name": "Чкаловская",
                "lat": 59.96119599999999,
                "lng": 30.29182800000001
            },
            {
                "name": "Римская",
                "lat": 55.746689,
                "lng": 37.67950599999995
            },
            {
                "name": "Крестьянская застава",
                "lat": 55.73227499999999,
                "lng": 37.66552100000001
            },
            {
                "name": "Дубровка",
                "lat": 55.717828,
                "lng": 37.67663100000004
            },
            {
                "name": "Кожуховская",
                "lat": 55.706289,
                "lng": 37.685595000000035
            },
            {
                "name": "Печатники",
                "lat": 55.693163,
                "lng": 37.726901
            },
            {
                "name": "Волжская",
                "lat": 55.690904,
                "lng": 37.75332000000003
            },
            {
                "name": "Люблино",
                "lat": 55.67568,
                "lng": 37.761758999999984
            },
            {
                "name": "Братиславская",
                "lat": 55.65952799999999,
                "lng": 37.750610999999935
            },
            {
                "name": "Марьино",
                "lat": 55.650167,
                "lng": 37.74373400000002
            },
            {
                "name": "Борисово",
                "lat": 55.63346199999999,
                "lng": 37.74407199999996
            },
            {
                "name": "Шипиловская",
                "lat": 55.62100599999999,
                "lng": 37.743600000000015
            },
            {
                "name": "Зябликово",
                "lat": 55.61203099999999,
                "lng": 37.74494600000003
            }
        ]
    },
    {
        "name": "Каховская линия",
        "color": "#29b1a6",
        "stations": [
            {
                "name": "Каширская",
                "lat": 55.655134,
                "lng": 37.64884299999994
            },
            {
                "name": "Варшавская",
                "lat": 55.653343,
                "lng": 37.61996599999998
            },
            {
                "name": "Каховская",
                "lat": 55.653074,
                "lng": 37.598476000000005
            }
        ]
    },
    {
        "name": "Бутовская линия",
        "color": "#8bc0d1",
        "stations": [
            {
                "name": "Улица Старокачаловская",
                "lat": 55.56934099999999,
                "lng": 37.57651499999997
            },
            {
                "name": "Улица Скобелевская",
                "lat": 55.54814099999999,
                "lng": 37.55466000000001
            },
            {
                "name": "Бульвар адмирала Ушакова",
                "lat": 55.54516899999999,
                "lng": 37.54228999999998
            },
            {
                "name": "Улица Горчакова",
                "lat": 55.542106,
                "lng": 37.53171599999996
            },
            {
                "name": "Бунинская аллея",
                "lat": 55.537949,
                "lng": 37.515382000000045
            }
        ]
    }
];