var allStations = [
    {
        'name': 'Замоскворецкая линия',
        'color': '#0a6f20',
        'stations': [
            {
                name: 'Алма-Атинская',
                'lat': 55.632813,
                'lng': 37.766061000000036
            },
            {   name: 'Красногвардейская',
                'lat': 55.61386599999999,
                'lng': 37.74454400000002
            },
            {
                'name': 'Домодедовская',
                'lat': 55.61095299999999,
                'lng': 37.71909000000005
            },
            {
                'name': 'Орехово',
                'lat': 55.613195,
                'lng': 37.69496600000002
            },
            {
                'name': 'Царицыно',
                'lat': 55.62145599999999,
                'lng': 37.669452999999976
            },
            {
                'name': 'Кантемировская',
                'lat': 55.635715,
                'lng': 37.656600000000026
            },
            {
                'name': 'Каширская',
                'lat': 55.655134,
                'lng': 37.64884299999994
            },
            {
                'name': 'Коломенская',
                'lat': 55.678271,
                'lng': 37.66384199999993
            },
            {
                'name': 'Автозаводская',
                'lat': 55.707394,
                'lng': 37.65729699999997
            },
            {
                'name': 'Павелецкая',
                'lat': 55.731266,
                'lng': 37.636262999999985
            },
            {
                'name': 'Новокузнецкая',
                'lat': 55.742424,
                'lng': 37.62926300000004
            },
            {
                'name': 'Театральная',
                'lat': 55.7576,
                'lng': 37.61873800000001
            },
            {
                'name': 'Тверская',
                'lat': 55.764847,
                'lng': 37.60486000000003
            },
            {
                'name': 'Маяковская',
                'lat': 55.770126,
                'lng': 37.59593399999994
            },
            {
                'name': 'Белорусская',
                'lat': 55.777094,
                'lng': 37.58184700000004
            },
            {
                'name': 'Динамо',
                'lat': 55.789711,
                'lng': 37.55818399999998
            },
            {
                'name': 'Аэропорт',
                'lat': 55.800365,
                'lng': 37.53262799999993
            },
            {
                'name': 'Сокол',
                'lat': 55.80478,
                'lng': 37.51554799999997
            },
            {
                'name': 'Войковская',
                'lat': 55.819087,
                'lng': 37.49788799999999
            },
            {
                'name': 'Водный стадион',
                'lat': 55.83596739999999,
                'lng': 37.483592499999986
            },
            {
                'name': 'Речной вокзал',
                'lat': 55.855055,
                'lng': 37.47610899999995
            }
        ]
    }
]